spec/vcr_cassettes/invoices/single_param_find_by_hash.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.fortnox.se/3/invoices/?yourreference=Gandalf%20the%20Grey
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      Authorization:
      - "<AUTHORIZATION>"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Length:
      - '412'
      Content-Type:
      - application/json
      Date:
      - Thu, 02 Jun 2022 16:32:27 GMT
      Vary:
      - Accept-Encoding
      X-Build:
      - 380d444b08
      X-Frame-Options:
      - sameorigin
      X-Rack-Responsetime:
      - '143'
      X-Uid:
      - a94e38f6
      Server:
      - Fortnox
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - '0'
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - 'upgrade-insecure-requests;frame-ancestors https://*.fortnox.se;report-uri
        /api/cspreport;connect-src ''self'' https://a.storyblok.com wss://*.fortnox.se
        *.fortnox.se *.findity.com *.livechatinc.com mybusiness.pwc.se themes.googleusercontent.com
        s3.amazonaws.com/helpjuice-static/ *.helpjuice.com *.vimeo.com fonts.googleapis.com
        fonts.gstatic.com ''unsafe-inline'' ''unsafe-eval'' blob: data:'
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains
    body:
      encoding: ASCII-8BIT
      string: '{"MetaInformation":{"@TotalResources":2,"@TotalPages":1,"@CurrentPage":1},"Invoices":[{"@url":"https:\/\/api.fortnox.se\/3\/invoices\/17","Balance":0,"Booked":false,"Cancelled":false,"CostCenter":"","Currency":"SEK","CurrencyRate":"1","CurrencyUnit":1,"CustomerName":"Updated
        name","CustomerNumber":"1","DocumentNumber":"17","DueDate":"2022-07-02","ExternalInvoiceReference1":"","ExternalInvoiceReference2":"","InvoiceDate":"2022-06-02","InvoiceType":"INVOICE","NoxFinans":false,"OCR":"1743","VoucherNumber":null,"VoucherSeries":null,"VoucherYear":null,"WayOfDelivery":"","TermsOfPayment":"30","Project":"","Sent":false,"Total":0,"FinalPayDate":null},{"@url":"https:\/\/api.fortnox.se\/3\/invoices\/19","Balance":0,"Booked":false,"Cancelled":false,"CostCenter":"","Currency":"SEK","CurrencyRate":"1","CurrencyUnit":1,"CustomerName":"Updated
        name","CustomerNumber":"1","DocumentNumber":"19","DueDate":"2022-07-02","ExternalInvoiceReference1":"","ExternalInvoiceReference2":"","InvoiceDate":"2022-06-02","InvoiceType":"INVOICE","NoxFinans":false,"OCR":"1941","VoucherNumber":null,"VoucherSeries":null,"VoucherYear":null,"WayOfDelivery":"","TermsOfPayment":"30","Project":"","Sent":false,"Total":0,"FinalPayDate":null}]}'
    http_version: 
  recorded_at: Thu, 02 Jun 2022 16:32:27 GMT
recorded_with: VCR 4.0.0
